*** Chapter 3: Basics

- C has few features
- it is simple, but not easy

- two kinds of definitions:
  - function definitions
  - structure definitions

- execution always starts at main
- we manipulate variables
- each of these have types

#+BEGIN_SRC C :tangle features.c 
int main() {
  int count;
  int count = 10;
  char last_initial = 'H';
  int age = 23;
  long age_of_universe = 1.3789e6;
  float liters_per_pint = 0.568f;
  double speed_of_swallow = 0.01072896;


}
#+END_SRC

#+RESULTS:

- functions have a return type declaration, a name and a parenthesis filled with arguments
- 
#+BEGIN_SRC C  :tangle add.c
#include <stdio.h>
int add_together(int x, int y) {
  int result = x + y;
  return result;
}
int main() {
  int num1 = 2;
  float num2 = 2.5;
  float res = add_together(num1, num2);
  printf("res is %f", res);
  return 0;
}
#+END_SRC

#+RESULTS:
- OK, so C will silently convert the type of the argument to the type it expects
- the above add program returns 4, not 4.5

- hmmm, *gdb* is pretty rocking
- GDB commands (for future reference)
  - step (take one step)
  - break fn_name (create breakpoint)
  - next (next statement, don't step into function)
  - file (load file with debugging symbols)

- variable start out with garbage
- they only resolve after the step
- ~-g~ option adds debug symbols


- Structures are used to declare new types
- several variables bundled together
#+BEGIN_SRC C :tangle struct.c
#include <stdio.h>
#include <math.h>
typedef struct {
  float x;
  float y;
} point;

int main() {
  point p;
  p.x = 0.1;
  p.y = 10;
  float length = sqrt(p.x * p.x + p.y * p.y);
  printf("length is %f\n", length);
}
#+END_SRC
- it doesn't tell us that we gave it an integer above, either

#+BEGIN_SRC sh
cc -g --std=c99 -Wall -Wpedantic  struct.c -o str.c
#+END_SRC
- this doesn't work
- I have offended the linker

#+BEGIN_SRC sh
cc -g --std=c99 -Wall -Wpedantic  struct.c -o str.c -lm
#+END_SRC

- this is the correct spell to pacify the linker
- the syntax is normally l + name of library (normally in a short form) 
- ~-lm~ links to the system maths library


- we declare pointers using the star notation ~a*~ is a pointer to a
- ~int*~ is an int pointer
- ~char*~ is a char pointer
- ~int**~ is a pointer to a pointer to an int
- pointers are needed for strings and lists
- these will apparently come up later


- represented by the pointer type ~char*~
- stored as a list of characters, with a null terminator at the end
- can be declared literally using quotation marks
